yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_usbpd_pwr.c
/**
 ******************************************************************************
 * @file    stm32h7rsxx_nucleo_usbpd_pwr.c
 * @author  MCD Application Team
 * @brief   This file provides a set of firmware functions to manage USB-PD Power:
 *            - VBUS control
 *            - VBUS voltage/current measurement
 *            - VCONN control
 *            - VBUS presence detection
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_mybrd_usbpd_pwr.h"
#include "stm32h7rsxx_mybrd_bus.h"

#if defined(_TRACE)
    #include "usbpd_core.h"
    #include "usbpd_trace.h"
    #include "string.h"
    #ifndef _STDIO
        #include "stdio.h"
    #endif /* _STDIO */
#endif     /* _TRACE */

/** @addtogroup BSP
 * @{
 */

/** @addtogroup STM32H7RSXX_NUCLEO
 * @{
 */

/** @addtogroup USBPD_PWR
 * @{
 */

/** @defgroup STM32H7RSXX_NUCLEO_USBPD_PWR_Exported_Variables Exported Variables
 * @{
 */
/**
 * @}
 */

/** @defgroup STM32H7RSXX_NUCLEO_USBPD_PWR_Private_Typedef Private Typedef
 * @{
 */
/**
 * @brief  Port HW configuration description
 */
typedef struct
{
    uint8_t Type;    /*!< HW component associated to Port          */
    uint8_t Address; /*!< I2C address (if any) associated to Port  */
} USBPD_PWR_PortConfig_t;

/**
 * @brief  Port BSP Power status
 */
typedef struct
{
    uint8_t IsInitialized;                                /*!< Port Context Initialization status       */
    uint8_t IsItEnabled;                                  /*!< Port IT enabled status                   */
    USBPD_PWR_PowerRoleTypeDef PwrRole;                   /*!< Port current power role (SRC or SNK)     */
    USBPD_PWR_PowerModeTypeDef PwrSavingMode;             /*!< Port current power saving mode           */
    uint32_t LastFaultTick;                               /*!< Current Tick on last detected fault      */
    USBPD_PWR_VBUSDetectCallbackFunc* VBUSDetectCallback; /*!< Port callback for VBUS detection event   */
} USBPD_PWR_PortStatus_t;

/**
 * @}
 */

/** @defgroup STM32H7RSXX_NUCLEO_USBPD_PWR_Private_Constants Private Constants
 * @{
 */

/* Maximum digital value of the ADC output (12 Bits resolution)
   To convert ADC measurement to an absolute voltage value:
   VCHANNELx = ADCx_DATA x (VDD/ADC_FULL_SCALE)
  */
#define ADC_FULL_SCALE (0x0FFFU)

/* Delay between ADC end of calibration and ADC enable.                     */
/* Delay estimation in CPU cycles: Case of ADC enable done                  */
/* immediately after ADC calibration, ADC clock setting slow                */
/* (LL_ADC_CLOCK_ASYNC_DIV32). Use a higher delay if ratio                  */
/* (CPU clock / ADC clock) is above 32.                                     */

#define ADC_DELAY_CALIB_ENABLE_CPU_CYCLES (LL_ADC_DELAY_CALIB_ENABLE_ADC_CYCLES * 32U)

#define VDDA_APPLI (3300U)

#define ABS(__VAL__) (((int32_t) (__VAL__)) < 0 ? -((int32_t) (__VAL__)) : ((int32_t) (__VAL__)))

#define IS_PWR_TCPP0203_NOT_ZERO(__VALUE__) ((__VALUE__) != 0U)

/* Minimum time between 2 detected faults allowing to consider that
   fault could be due to a false detection (could be recovered).
   => if 2 faults occurred in less than that duration, no recovery will be executed */
#define USBPD_PWR_FAULT_MIN_TIME_RECOVERY (1000U) /* 1s */

/**
 * @}
 */

/** @defgroup STM32H7RSXX_NUCLEO_USBPD_PWR_Private_Macros Private Macros
 * @{
 */
#ifdef _TRACE
    #define BSP_USBPD_PWR_TRACE(_PORT_, _MSG_) USBPD_TRACE_Add(USBPD_TRACE_DEBUG, (uint8_t) _PORT_, 0U, (uint8_t*) _MSG_, strlen(_MSG_));
#else
    #define BSP_USBPD_PWR_TRACE(_PORT_, _MSG_)
#endif /* _TRACE */

/**
 * @}
 */

/** @defgroup STM32H7RSXX_NUCLEO_USBPD_PWR_Private_Functions Private Functions
 * @{
 */
static void PWR_TCPP0203_Configure_ADC(void);
static void PWR_TCPP0203_GPIOConfigInit(uint32_t PortNum);
static void PWR_TCPP0203_ITConfigInit(uint32_t PortNum);
static int32_t PWR_TCPP0203_BUSConfigInit(uint32_t PortNum, uint16_t Address);
static int32_t PWR_TCPP0203_ConfigDeInit(uint32_t PortNum);
static void PWR_TCPP0203_EventCallback(uint32_t PortNum);

static uint32_t PWR_TCPP0203_ConvertADCDataToVoltage(uint32_t ADCData, uint32_t Ra, uint32_t Rb);
static int32_t PWR_TCPP0203_ConvertADCDataToCurrent(uint32_t ADCData, uint32_t Ga, uint32_t Rs);

/**
 * @}
 */

/** @defgroup STM32H7RSXX_NUCLEO_USBPD_PWR_Private_Variables Private Variables
 * @{
 */

static USBPD_PWR_PortConfig_t USBPD_PWR_Port_Configs[USBPD_PWR_INSTANCES_NBR] =
    {
        {
         USBPD_PWR_HW_CONFIG_TYPE_TCPP03, /* Port 0 : TCPP Type - default, will be read  */
            TCPP0203_I2C_ADDRESS_X68,        /* TCPP0x on shield (Address 0x34)             */
        },
};

static USBPD_PWR_PortStatus_t USBPD_PWR_Port_Status[USBPD_PWR_INSTANCES_NBR] =
    {
        {0U, 0U, POWER_ROLE_SINK, USBPD_PWR_MODE_OFF, 0U, NULL},
};

static TCPP0203_Object_t USBPD_PWR_PortCompObj[USBPD_PWR_INSTANCES_NBR] = {0U};
static TCPP0203_Drv_t* USBPD_PWR_PortCompDrv[USBPD_PWR_INSTANCES_NBR]   = {NULL};

/**
 * @}
 */

/** @addtogroup STM32H7RSXX_NUCLEO_USBPD_PWR_Exported_Functions
 * @{
 */

/**
 * @brief  Global initialization of PWR resource used by USB-PD
 * @param  PortNum Type-C port identifier
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_Init(uint32_t PortNum)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_Init --");

        if (USBPD_PWR_Port_Status[PortNum].IsInitialized == 0U)
        {
            /* Initialisation according to HW configuration type of port */
            switch (USBPD_PWR_Port_Configs[PortNum].Type)
            {
            case USBPD_PWR_HW_CONFIG_TYPE_TCPP02:
            case USBPD_PWR_HW_CONFIG_TYPE_TCPP03:
                /* Set default Role to SNK */
                USBPD_PWR_Port_Status[PortNum].PwrRole = POWER_ROLE_SINK;

                /* Set default Power Mode to Hibernate */
                USBPD_PWR_Port_Status[PortNum].PwrSavingMode = USBPD_PWR_MODE_HIBERNATE;

