yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_usbpd_pwr.c
                /* Reset port callback for VBUS detection event */
                USBPD_PWR_Port_Status[PortNum].VBUSDetectCallback = NULL;

                /* Reset last detected fault Tick */
                USBPD_PWR_Port_Status[PortNum].LastFaultTick = 0U;

                /* Initialize required GPIOs */
                PWR_TCPP0203_GPIOConfigInit(PortNum);

                /* Initialize EXTI for FLGn signal */
                PWR_TCPP0203_ITConfigInit(PortNum);

                /* Enable component */
                TCPP0203_PORT0_ENABLE_GPIO_SET();

                /* Initialize required BUS for communication */
                ret = PWR_TCPP0203_BUSConfigInit(PortNum, USBPD_PWR_Port_Configs[PortNum].Address);
                break;

            case USBPD_PWR_HW_CONFIG_TYPE_DEFAULT:
            case USBPD_PWR_HW_CONFIG_TYPE_TCPP01:
            default:
                ret = BSP_ERROR_WRONG_PARAM;
                break;
            }

            if (ret == BSP_ERROR_NONE)
            {
                /* Set Initialisation flag */
                USBPD_PWR_Port_Status[PortNum].IsInitialized = 1U;
            }
        }
    }
    return ret;
}

/**
 * @brief  Global de-initialization of PWR resource used by USB-PD
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_Deinit(uint32_t PortNum)
{
    int32_t ret;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_DeInit --");

        /* Deinitialize Power config for port */
        switch (USBPD_PWR_Port_Configs[PortNum].Type)
        {
        case USBPD_PWR_HW_CONFIG_TYPE_TCPP02:
        case USBPD_PWR_HW_CONFIG_TYPE_TCPP03:
            /* Perform any treatments required for de-initialization for GPIO, BUS communication, Interrupts */
            ret = PWR_TCPP0203_ConfigDeInit(PortNum);
            break;

        case USBPD_PWR_HW_CONFIG_TYPE_DEFAULT:
        case USBPD_PWR_HW_CONFIG_TYPE_TCPP01:
        default:
            ret = BSP_ERROR_WRONG_PARAM;
            break;
        }

        /* Reset Initialisation flag */
        USBPD_PWR_Port_Status[PortNum].IsInitialized = 0U;
    }

    return ret;
}

/**
 * @brief  Assign Power role for current Port (Source or Sink)
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  Role Type-C port role
 *         This parameter can take one of the following values:
 *         @arg @ref POWER_ROLE_SOURCE
 *         @arg @ref POWER_ROLE_SINK
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_SetRole(uint32_t PortNum, USBPD_PWR_PowerRoleTypeDef Role)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        switch (Role)
        {
        case POWER_ROLE_SOURCE:
            /* Port Role is now SRC */
            BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_SetRole : SRC --");
            /* Set port power Role */
            USBPD_PWR_Port_Status[PortNum].PwrRole = Role;

            /* Ensure that TCPP0203 mode is not set to Hibernate */
            if (USBPD_PWR_Port_Status[PortNum].PwrSavingMode == USBPD_PWR_MODE_HIBERNATE)
            {
                if (USBPD_PWR_PortCompDrv[PortNum]->SetPowerMode(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_POWER_MODE_LOWPOWER) != TCPP0203_OK)
                {
                    ret = BSP_ERROR_COMPONENT_FAILURE;
                }
                else
                {
                    USBPD_PWR_Port_Status[PortNum].PwrSavingMode = USBPD_PWR_MODE_LOWPOWER;
                }
            }
            break;

        case POWER_ROLE_SINK:
            /* Port Role is now SNK */
            BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_SetRole : SNK --");
            /* Set port power Role */
            USBPD_PWR_Port_Status[PortNum].PwrRole = Role;
            break;

        default:
            ret = BSP_ERROR_WRONG_PARAM;
            break;
        }
    }

    return ret;
}

/**
 * @brief  Set operating mode of Port regarding power saving constraints
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  PwrMode Type-C port power saving mode
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_MODE_OFF
 *         @arg @ref USBPD_PWR_MODE_HIBERNATE
 *         @arg @ref USBPD_PWR_MODE_LOWPOWER
 *         @arg @ref USBPD_PWR_MODE_NORMAL
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_SetPowerMode(uint32_t PortNum, USBPD_PWR_PowerModeTypeDef PwrMode)
{
    uint8_t flg_reg = 0U;
    int32_t ret     = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_SetPowerMode --");

        /* Evaluate requested Power config for port */
        switch (PwrMode)
        {
        case USBPD_PWR_MODE_OFF:
            /* Port should enter OFF mode : Reset TCPP0203 Reg0 */
            if (USBPD_PWR_PortCompDrv[PortNum]->Reset(&USBPD_PWR_PortCompObj[PortNum]) != TCPP0203_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            break;

        case USBPD_PWR_MODE_HIBERNATE:
            /* Port Mode is Hibernate : (Default state at startup) suitable for SNK role
                 - Dead Batteries Enabled,
                 - Gate Driver Consumer controlled by I2C, Gate Driver Provider OFF
                 - waiting for VBUS_OK in FLGn (interrupt)
            */
            BSP_USBPD_PWR_TRACE(PortNum, "-- Hibernate --");
            if (USBPD_PWR_PortCompDrv[PortNum]->SetPowerMode(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_POWER_MODE_HIBERNATE) != TCPP0203_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }

