yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_usbpd_pwr.c
            /* Check if VBUS is present (in case of SNK VBUS powered device) */
            /* Read Flags register (FLGn) */
            if (USBPD_PWR_PortCompDrv[PortNum]->ReadFlagRegister(&USBPD_PWR_PortCompObj[PortNum], &flg_reg) == TCPP0203_OK)
            {
                /* If FLGn has been set to 0 in LOW POWER or HIBERNATE mode,
                   it is expected that a VBUS_OK condition is detected.
                   In this case, if any, vBus Detection callback could be called */
                if ((flg_reg & TCPP0203_FLAG_VBUS_OK_SET) == TCPP0203_FLAG_VBUS_OK_SET)
                {
                    if (USBPD_PWR_Port_Status[PortNum].VBUSDetectCallback != NULL)
                    {
                        /* In case of TCPP03 in Hibernate Mode (SNK config),
                           Mode is set to Low power to enable TCPP03 behavior on CC lines */
                        /* Switch to Low Power mode */
                        BSP_USBPD_PWR_TRACE(PortNum, "-- Low Power --");
                        if (USBPD_PWR_PortCompDrv[PortNum]->SetPowerMode(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_POWER_MODE_LOWPOWER) != TCPP0203_OK)
                        {
                            ret = BSP_ERROR_COMPONENT_FAILURE;
                        }

                        USBPD_PWR_Port_Status[PortNum].VBUSDetectCallback(PortNum, VBUS_CONNECTED);
                    }
                }
                else
                {
                    /* VBUS indication not present in FLGn flags : nothing more to be done */
                }
            }
            break;

        case USBPD_PWR_MODE_LOWPOWER:
            /* Port Mode is Low Power : suitable while toggling SNK/SRC is case of DRP
                 - Dead Batteries Disabled,
                 - Gate Driver Consumer or Provider controlled by I2C
                 - waiting for VBUS_OK in FLGn (interrupt)
            */
            BSP_USBPD_PWR_TRACE(PortNum, "-- Low Power --");
            if (USBPD_PWR_PortCompDrv[PortNum]->SetPowerMode(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_POWER_MODE_LOWPOWER) != TCPP0203_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            break;

        case USBPD_PWR_MODE_NORMAL:
            /* Port Mode is Normal : No power saving measure (Explicit contract in place) */
            BSP_USBPD_PWR_TRACE(PortNum, "-- Normal --");
            if (USBPD_PWR_PortCompDrv[PortNum]->SetPowerMode(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_POWER_MODE_NORMAL) != TCPP0203_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            break;

        default:
            ret = BSP_ERROR_WRONG_PARAM;
            break;
        }

        /* Set port low power operating mode */
        USBPD_PWR_Port_Status[PortNum].PwrSavingMode = PwrMode;
    }

    return ret;
}

/**
 * @brief  Get operating mode of Port regarding power saving constraints
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  PwrMode Pointer on current Type-C port power saving mode value
 *         Following values are available :
 *         @arg @ref USBPD_PWR_MODE_OFF
 *         @arg @ref USBPD_PWR_MODE_HIBERNATE
 *         @arg @ref USBPD_PWR_MODE_LOWPOWER
 *         @arg @ref USBPD_PWR_MODE_NORMAL
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_GetPowerMode(uint32_t PortNum, USBPD_PWR_PowerModeTypeDef* PwrMode)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_GetPowerMode --");

        /* Get port low power operating mode */
        *PwrMode = USBPD_PWR_Port_Status[PortNum].PwrSavingMode;
    }

    return ret;
}

/**
 * @brief  Initialize the hardware resources used by the Type-C power delivery (PD)
 *         controller.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSInit(uint32_t PortNum)
{
    int32_t ret;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VBUSInit --");

        /* Initialize required HW for VBUS management */
        switch (USBPD_PWR_Port_Configs[PortNum].Type)
        {
        case USBPD_PWR_HW_CONFIG_TYPE_TCPP02:
        case USBPD_PWR_HW_CONFIG_TYPE_TCPP03:
            /* Switch to Normal mode */
            ret = BSP_USBPD_PWR_SetPowerMode(PortNum, USBPD_PWR_MODE_NORMAL);

            PWR_TCPP0203_Configure_ADC();
            break;

        case USBPD_PWR_HW_CONFIG_TYPE_DEFAULT:
        case USBPD_PWR_HW_CONFIG_TYPE_TCPP01:
        default:
            ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
            break;
        }
    }
    return ret;
}

/**
 * @brief  Release the hardware resources used by the Type-C power delivery (PD)
 *         controller.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSDeInit(uint32_t PortNum)
{
    int32_t ret;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VBUSDeInit --");

        /* Only for TCPP03 */
        if (USBPD_PWR_HW_CONFIG_TYPE_TCPP03 == USBPD_PWR_Port_Configs[PortNum].Type)
        {
            /* Close Gate Driver Consumer, only for TCPP03 */
            if (USBPD_PWR_PortCompDrv[PortNum]->SetGateDriverConsumer(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_GD_CONSUMER_SWITCH_CLOSED) != TCPP0203_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
                return ret;
            }
        }

        /* Common for TCPP02 / TCPP03 */
        if ((USBPD_PWR_HW_CONFIG_TYPE_TCPP02 == USBPD_PWR_Port_Configs[PortNum].Type) ||
            (USBPD_PWR_HW_CONFIG_TYPE_TCPP03 == USBPD_PWR_Port_Configs[PortNum].Type))
        {
            /* Restore default gates configuration for Low power mode */
            BSP_USBPD_PWR_TRACE(PortNum, "-- GDP/GDC setting : default --");

