yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_usbpd_pwr.c
            if (USBPD_PWR_Port_Status[PortNum].PwrRole == POWER_ROLE_SOURCE)
            {
                /* Switch to Low Power mode */
                ret = BSP_USBPD_PWR_SetPowerMode(PortNum, USBPD_PWR_MODE_LOWPOWER);
            }
            else
            {
                /* Switch to Hibernate mode */
                ret = BSP_USBPD_PWR_SetPowerMode(PortNum, USBPD_PWR_MODE_HIBERNATE);
            }
        }
        else
        {
            ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
        }
    }
    return ret;
}

/**
 * @brief  Enable power supply over VBUS.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSOn(uint32_t PortNum)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VBUSOn --");

        /* Port Role is now SRC : Close Gate Driver Provider */
        if (USBPD_PWR_Port_Status[PortNum].PwrRole == POWER_ROLE_SOURCE)
        {
            /* Only for TCPP03 */
            if (USBPD_PWR_HW_CONFIG_TYPE_TCPP03 == USBPD_PWR_Port_Configs[PortNum].Type)
            {
                /* Open Gate Driver Consumer, only for TCPP03 */
                if (USBPD_PWR_PortCompDrv[PortNum]->SetGateDriverConsumer(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_GD_CONSUMER_SWITCH_OPEN) != TCPP0203_OK)
                {
                    ret = BSP_ERROR_COMPONENT_FAILURE;
                    return ret;
                }
            }

            /* Common for TCPP02 / TCPP03 */
            if ((USBPD_PWR_HW_CONFIG_TYPE_TCPP02 == USBPD_PWR_Port_Configs[PortNum].Type) ||
                (USBPD_PWR_HW_CONFIG_TYPE_TCPP03 == USBPD_PWR_Port_Configs[PortNum].Type))
            {
                HAL_Delay(2);

                if (USBPD_PWR_PortCompDrv[PortNum]->SetGateDriverProvider(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_GD_PROVIDER_SWITCH_CLOSED) != TCPP0203_OK)
                {
                    ret = BSP_ERROR_COMPONENT_FAILURE;
                }
                BSP_USBPD_PWR_TRACE(PortNum, "-- GDP/GDC setting : SRC --");
            }
            else
            {
                ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
            }
        }
        else
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }
    }
    return ret;
}

/**
 * @brief  Disable power supply over VBUS.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSOff(uint32_t PortNum)
{
    int32_t ret = BSP_ERROR_NONE;
    uint32_t vbus;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        /* Open Gate driver provider */
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VBUSOff --");
        if (USBPD_PWR_PortCompDrv[PortNum]->SetGateDriverProvider(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_GD_PROVIDER_SWITCH_OPEN) != TCPP0203_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
            /* Set Discharge On */
            if (USBPD_PWR_PortCompDrv[PortNum]->SetVBusDischarge(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_VBUS_DISCHARGE_ON) != TCPP0203_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            else
            {
                /* Wait VBUS level becomes lower than USBPD_PWR_LOW_VBUS_THRESHOLD */
                uint8_t counter = 0U;

                (void) BSP_USBPD_PWR_VBUSGetVoltage(PortNum, &vbus);

                while ((vbus >= (USBPD_PWR_LOW_VBUS_THRESHOLD - 200U)) && (counter < 20U))
                {
                    counter++;
                    HAL_Delay(20);
                    (void) BSP_USBPD_PWR_VBUSGetVoltage(PortNum, &vbus);
                }

                /* Set Discharge Off */
                if (USBPD_PWR_PortCompDrv[PortNum]->SetVBusDischarge(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_VBUS_DISCHARGE_OFF) != TCPP0203_OK)
                {
                    ret = BSP_ERROR_COMPONENT_FAILURE;
                }

                HAL_Delay(30);

                /* Only for TCPP03 */
                if (USBPD_PWR_HW_CONFIG_TYPE_TCPP03 == USBPD_PWR_Port_Configs[PortNum].Type)
                {
                    /* Close Gate Driver Consumer, only for TCPP03 */
                    if (USBPD_PWR_PortCompDrv[PortNum]->SetGateDriverConsumer(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_GD_CONSUMER_SWITCH_CLOSED) != TCPP0203_OK)
                    {
                        ret = BSP_ERROR_COMPONENT_FAILURE;
                    }
                }
            }
        }
    }
    return ret;
}

/**
 * @brief  Get actual VBUS status.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  pState VBUS status (1: On, 0: Off)
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSIsOn(uint32_t PortNum, uint8_t* pState)
{
    int32_t ret = BSP_ERROR_NONE;
    uint8_t val = 0U;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        if (USBPD_PWR_PortCompDrv[PortNum]->GetGateDriverProviderAck(&USBPD_PWR_PortCompObj[PortNum], &val) != TCPP0203_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
            if (val == TCPP0203_GD_PROVIDER_SWITCH_ACK_OPEN)
            {
                *pState = 0U;
            }
            else
            {
                *pState = 1U;
            }
        }
    }
    return ret;
}

/**
 * @brief  Set a fixed PDO and manage the power control.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  VbusTargetInmv the vbus Target (in mV)
 * @param  OperatingCurrent the Operating Current (in mA)
 * @param  MaxOperatingCurrent the Max Operating Current (in mA)
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSSetVoltage_Fixed(uint32_t PortNum, uint32_t VbusTargetInmv, uint32_t OperatingCurrent, uint32_t MaxOperatingCurrent)
{
    int32_t ret = BSP_ERROR_NONE;
    UNUSED(MaxOperatingCurrent);
    UNUSED(OperatingCurrent);
    UNUSED(VbusTargetInmv);

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    return ret;
}

/**
 * @brief  Set a variable PDO and manage the power control.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  VbusTargetMinInmv the vbus Target min (in mV)
 * @param  VbusTargetMaxInmv the vbus Target max (in mV)
 * @param  OperatingCurrent the Operating Current (in mA)
 * @param  MaxOperatingCurrent the Max Operating Current (in mA)
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSSetVoltage_Variable(uint32_t PortNum, uint32_t VbusTargetMinInmv, uint32_t VbusTargetMaxInmv, uint32_t OperatingCurrent, uint32_t MaxOperatingCurrent)
{
    int32_t ret;
    UNUSED(MaxOperatingCurrent);
    UNUSED(OperatingCurrent);
    UNUSED(VbusTargetMaxInmv);
    UNUSED(VbusTargetMinInmv);

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
    }
    return ret;
}

/**
 * @brief  Set a Battery PDO and manage the power control.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  VbusTargetMin the vbus Target min (in mV)
 * @param  VbusTargetMax the vbus Target max (in mV)
 * @param  OperatingPower the Operating Power (in mW)
 * @param  MaxOperatingPower the Max Operating Power (in mW)
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSSetVoltage_Battery(uint32_t PortNum, uint32_t VbusTargetMin, uint32_t VbusTargetMax, uint32_t OperatingPower, uint32_t MaxOperatingPower)
{
    int32_t ret;
    UNUSED(OperatingPower);
    UNUSED(VbusTargetMax);
    UNUSED(VbusTargetMin);
    UNUSED(MaxOperatingPower);

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        /* Set the power, the precision must be at 5% */
        /* Set the current limitation */
        /* not implemented */

