yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_usbpd_pwr.c
        ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
    }
    return ret;
}

/**
 * @brief  Set a APDO and manage the power control.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  VbusTargetInmv the vbus Target (in mV)
 * @param  OperatingCurrent the Operating current (in mA)
 * @param  Delta Delta between with previous APDO (in mV), 0 means APDO start
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSSetVoltage_APDO(uint32_t PortNum, uint32_t VbusTargetInmv, uint32_t OperatingCurrent, int32_t Delta)
{
    int32_t ret;
    UNUSED(Delta);
    UNUSED(OperatingCurrent);
    UNUSED(VbusTargetInmv);

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
    }
    return ret;
}

/**
 * @brief  Set the VBUS disconnection voltage threshold.
 * @note   Callback function invoked when VBUS falls below programmed threshold.
 * @note   By default VBUS disconnection threshold is set to 3.3V
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  VoltageThreshold VBUS disconnection voltage threshold (in mV)
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_SetVBUSDisconnectionThreshold(uint32_t PortNum, uint32_t VoltageThreshold)
{
    UNUSED(VoltageThreshold);
    int32_t ret;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
    }
    return ret;
}

/**
 * @brief  Register USB Type-C Current callback function.
 * @note   Callback function invoked when VBUS rises above 4V (VBUS present) or
 *         when VBUS falls below programmed threshold (VBUS absent).
 * @note   Callback function is un-registered when callback function pointer
 *         argument is NULL.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  pfnVBUSDetectCallback callback function pointer
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_RegisterVBUSDetectCallback(uint32_t PortNum, USBPD_PWR_VBUSDetectCallbackFunc* pfnVBUSDetectCallback)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if ((PortNum >= USBPD_PWR_INSTANCES_NBR) || (NULL == pfnVBUSDetectCallback))
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        /* Set port callback for VBUS detection event */
        USBPD_PWR_Port_Status[PortNum].VBUSDetectCallback = pfnVBUSDetectCallback;
    }
    return ret;
}

/**
 * @brief  Get actual voltage level measured on the VBUS line.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  pVoltage Pointer on measured voltage level (in mV)
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSGetVoltage(uint32_t PortNum, uint32_t* pVoltage)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if ((PortNum >= USBPD_PWR_INSTANCES_NBR) || (NULL == pVoltage))
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        uint32_t voltage;
        static __IO uint16_t adc_value;
        adc_value = LL_ADC_REG_ReadConversionData12(TCPP0203_PORT0_VBUSC_ADC_INSTANCE);
        voltage   = PWR_TCPP0203_ConvertADCDataToVoltage(adc_value, TCPP0203_PORT0_VBUSC_RA, TCPP0203_PORT0_VBUSC_RB);

        *pVoltage = voltage;
    }
    return ret;
}

/**
 * @brief  Get actual current level measured on the VBUS line.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @param  pCurrent Pointer on measured current level (in mA)
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSGetCurrent(uint32_t PortNum, int32_t* pCurrent)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if ((PortNum >= USBPD_PWR_INSTANCES_NBR) || (NULL == pCurrent))
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        int32_t current;
        uint16_t adc_value;
        adc_value = 0U; /* Not implemented */
        current   = PWR_TCPP0203_ConvertADCDataToCurrent(adc_value, TCPP0203_PORT0_IANA_ISENSE_GA, TCPP0203_PORT0_IANA_ISENSE_RS);

        *pCurrent = current;
    }
    return ret;
}

/**
 * @brief  Activate discharge on VBUS.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSDischargeOn(uint32_t PortNum)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VBUSDischargeOn --");

        if (USBPD_PWR_PortCompDrv[PortNum]->SetGateDriverProvider(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_GD_PROVIDER_SWITCH_OPEN) != TCPP0203_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
            if (USBPD_PWR_PortCompDrv[PortNum]->SetVBusDischarge(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_VBUS_DISCHARGE_ON) != TCPP0203_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
        }
    }
    return ret;
}

/**
 * @brief  Deactivate discharge on VBUS.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VBUSDischargeOff(uint32_t PortNum)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VBUSDischargeOff --");

