yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_usbpd_pwr.c
        if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnSwitch(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_VCONN_SWITCH_OPEN) != TCPP0203_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
            if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnDischarge(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_VCONN_DISCHARGE_ON) != TCPP0203_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }
        }
    }
    return ret;
}

/**
 * @brief  Deactivate discharge on VCONN.
 * @param  PortNum Type-C port identifier
 *         This parameter can take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
 * @retval BSP status
 */
int32_t BSP_USBPD_PWR_VCONNDischargeOff(uint32_t PortNum)
{
    int32_t ret = BSP_ERROR_NONE;

    /* Check if instance is valid */
    if (PortNum >= USBPD_PWR_INSTANCES_NBR)
    {
        ret = BSP_ERROR_WRONG_PARAM;
    }
    else
    {
        BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VCONNDischargeOff --");

        if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnDischarge(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_VCONN_DISCHARGE_OFF) != TCPP0203_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }
    }
    return ret;
}

/**
 * @brief  USBPD PWR callback used to notify a asynchronous PWR event.
 *         (This callback caould be called fromp an IT routine, associated to
 *         any PWR related event detection mechanism)
 * @param  PortNum Type-C port identifier
 * @retval None
 */
void BSP_USBPD_PWR_EventCallback(uint32_t PortNum)
{
    BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_EventCallback --");

    /* Handle USBPD PWR event */
    switch (USBPD_PWR_Port_Configs[PortNum].Type)
    {
    case USBPD_PWR_HW_CONFIG_TYPE_TCPP02:
    case USBPD_PWR_HW_CONFIG_TYPE_TCPP03:
        /* In case of TCPP0203, this callback could be called when an event is detected
           on FLGn line */
        PWR_TCPP0203_EventCallback(PortNum);
        break;

    case USBPD_PWR_HW_CONFIG_TYPE_DEFAULT:
    case USBPD_PWR_HW_CONFIG_TYPE_TCPP01:
    default:
        break;
    }
}

/**
 * @}
 */

/** @addtogroup STM32H7RSXX_NUCLEO_USBPD_PWR_Private_Functions
 * @{
 */

/**
 * @brief  Configure TCPP0203 used GPIO.
 * @note   GPIO used for TCPP0203 operation includes VBUS measurement, ENABLE pin driving
 * @param  PortNum   Port number
 * @retval None
 */
static void PWR_TCPP0203_GPIOConfigInit(uint32_t PortNum)
{
    UNUSED(PortNum);

    /* Configure ENABLE GPIO */
    TCPP0203_PORT0_ENABLE_GPIO_CLK_ENABLE();
    /* Configure IO in output push-pull mode to drive ENABLE */
    LL_GPIO_SetPinMode(TCPP0203_PORT0_ENABLE_GPIO_PORT, TCPP0203_PORT0_ENABLE_GPIO_PIN, TCPP0203_PORT0_ENABLE_GPIO_MODE);
    LL_GPIO_SetPinOutputType(TCPP0203_PORT0_ENABLE_GPIO_PORT, TCPP0203_PORT0_ENABLE_GPIO_PIN, TCPP0203_PORT0_ENABLE_GPIO_OUTPUT);
    LL_GPIO_SetPinSpeed(TCPP0203_PORT0_ENABLE_GPIO_PORT, TCPP0203_PORT0_ENABLE_GPIO_PIN, LL_GPIO_SPEED_FREQ_LOW);
    LL_GPIO_SetPinPull(TCPP0203_PORT0_ENABLE_GPIO_PORT, TCPP0203_PORT0_ENABLE_GPIO_PIN, TCPP0203_PORT0_ENABLE_GPIO_PUPD);

    /* Set ENABLE to default state */
    TCPP0203_PORT0_ENABLE_GPIO_DEFVALUE();

    /* Configure IANA GPIO */
    TCPP0203_PORT0_IANA_GPIO_CLK_ENABLE();
    /* Configure GPIO in Analog mode */
    LL_GPIO_SetPinMode(TCPP0203_PORT0_IANA_GPIO_PORT, TCPP0203_PORT0_IANA_GPIO_PIN, TCPP0203_PORT0_IANA_GPIO_MODE);

    /* Configure VBUS Connector sensing GPIO */
    TCPP0203_PORT0_VBUSC_GPIO_CLK_ENABLE();
    /* Configure GPIO in Analog mode */
    LL_GPIO_SetPinMode(TCPP0203_PORT0_VBUSC_GPIO_PORT, TCPP0203_PORT0_VBUSC_GPIO_PIN, TCPP0203_PORT0_VBUSC_GPIO_MODE);
}

/**
 * @brief  Configure ADC (ADC instance for Vsense and Isense: TCPP0203_PORT0_VBUSC_ADC_INSTANCE) and GPIO used by ADC channels.
 * @retval None
 */
static void PWR_TCPP0203_Configure_ADC(void)
{
    static ADC_HandleTypeDef hadc;

    /* USER CODE BEGIN ADC_Init 0 */
    TCPP0203_PORT0_VBUSC_ADC_CLK_ENABLE();

    /* Configure the GPIO as analog */
    TCPP0203_PORT0_VBUSC_GPIO_CLK_ENABLE();
    LL_GPIO_SetPinMode(TCPP0203_PORT0_VBUSC_GPIO_PORT, TCPP0203_PORT0_VBUSC_GPIO_PIN, TCPP0203_PORT0_VBUSC_GPIO_MODE);

    /* USER CODE END ADC1_Init 0 */

    RCC_PeriphCLKInitTypeDef RCC_PeriphClkInitStructure;
    RCC_PeriphClkInitStructure.PeriphClockSelection = RCC_PERIPHCLK_ADC;
    RCC_PeriphClkInitStructure.AdcClockSelection    = RCC_ADCCLKSOURCE_CLKP;
    if (HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphClkInitStructure) != HAL_OK)
    {
    }

    ADC_ChannelConfTypeDef sConfig = {0};

    /* USER CODE BEGIN ADC_Init 1 */

    /* USER CODE END ADC_Init 1 */
    /* Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion) */
    hadc.Instance                      = TCPP0203_PORT0_VBUSC_ADC_INSTANCE;
    hadc.Init.ClockPrescaler           = ADC_CLOCK_ASYNC_DIV4;
    hadc.Init.Resolution               = ADC_RESOLUTION_12B;
    hadc.Init.ScanConvMode             = ADC_SCAN_ENABLE;
    hadc.Init.EOCSelection             = ADC_EOC_SINGLE_CONV;
    hadc.Init.LowPowerAutoWait         = DISABLE;
    hadc.Init.ContinuousConvMode       = ENABLE;
    hadc.Init.NbrOfConversion          = 1;
    hadc.Init.DiscontinuousConvMode    = DISABLE;
    hadc.Init.ExternalTrigConv         = ADC_SOFTWARE_START;
    hadc.Init.ExternalTrigConvEdge     = ADC_EXTERNALTRIGCONVEDGE_NONE;
    hadc.Init.ConversionDataManagement = ADC_CONVERSIONDATA_DR;
    hadc.Init.Overrun                  = ADC_OVR_DATA_OVERWRITTEN;
    hadc.Init.OversamplingMode         = DISABLE;
    if (HAL_ADC_Init(&hadc) != HAL_OK)
    {
    }

    /* Configure Regular Channel */
    sConfig.Channel          = TCPP0203_PORT0_VBUSC_ADC_CHANNEL;
    sConfig.Rank             = TCPP0203_PORT0_VBUSC_ADC_RANK;
    sConfig.SamplingTime     = ADC_SAMPLETIME_247CYCLES_5;
    sConfig.SingleDiff       = ADC_SINGLE_ENDED; /* Single-ended input channel */
    sConfig.OffsetNumber     = ADC_OFFSET_NONE;  /* No offset subtraction */
    sConfig.Offset           = 0U;               /* Parameter discarded because offset correction is disabled */
    sConfig.OffsetSaturation = DISABLE;
    sConfig.OffsetSign       = ADC_OFFSET_SIGN_POSITIVE;

    if (HAL_ADC_ConfigChannel(&hadc, &sConfig) != HAL_OK)
    {
    }

    /* USER CODE BEGIN ADC_Init 2 */
    if (HAL_ADCEx_Calibration_Start(&hadc, ADC_SINGLE_ENDED) != HAL_OK)
    {
    }

    if (HAL_ADC_Start(&hadc) != HAL_OK)
    {
    }
    /* USER CODE END ADC_Init 2 */
}

/**
 * @brief  Configure TCPP0203 low level interrupt.
 * @note   Corresponds to EXTI mapped onto FLGn pin of TCPP0203
 * @param  PortNum   Port number
 * @retval None
 */
static void PWR_TCPP0203_ITConfigInit(uint32_t PortNum)
{
    if (USBPD_PWR_Port_Status[PortNum].IsItEnabled == 0U)
    {
        USBPD_PWR_Port_Status[PortNum].IsItEnabled = 1U;

