yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_usbpd_pwr.c
        /* Enable the GPIO EXTI clock */
        TCPP0203_PORT0_FLG_GPIO_CLK_ENABLE();
        /* Configure IO */
        LL_GPIO_SetPinMode(TCPP0203_PORT0_FLG_GPIO_PORT, TCPP0203_PORT0_FLG_GPIO_PIN, TCPP0203_PORT0_FLG_GPIO_MODE);
        LL_GPIO_SetPinPull(TCPP0203_PORT0_FLG_GPIO_PORT, TCPP0203_PORT0_FLG_GPIO_PIN, TCPP0203_PORT0_FLG_GPIO_PUPD);

        /* Connect External Line to the GPIO*/
        TCPP0203_PORT0_FLG_SET_EXTI();

        /* Enable a falling trigger EXTI line x Interrupt */
        TCPP0203_PORT0_FLG_EXTI_ENABLE();
        TCPP0203_PORT0_FLG_TRIG_ENABLE();

        /* Configure NVIC for EXTIx_IRQn */
        NVIC_SetPriority(TCPP0203_PORT0_FLG_EXTI_IRQN, TCPP0203_PORT0_FLG_IT_PRIORITY);
        NVIC_EnableIRQ(TCPP0203_PORT0_FLG_EXTI_IRQN);
    }
}

/**
 * @brief  I2C BUS registration for TCPP0203 communication
 * @param  PortNum   Port number
 * @param  Address   I2C Address
 * @retval BSP status
 */
static int32_t PWR_TCPP0203_BUSConfigInit(uint32_t PortNum, uint16_t Address)
{
    int32_t ret = BSP_ERROR_NONE;
    TCPP0203_IO_t TCPP0203IOCtx;
    uint8_t tcpp_type = 0U;

    /* Configure the TCPP0203 I2C driver */
    TCPP0203IOCtx.Address  = Address;
    TCPP0203IOCtx.Init     = BSP_I2C3_Init;
    TCPP0203IOCtx.DeInit   = BSP_I2C3_DeInit;
    TCPP0203IOCtx.ReadReg  = BSP_I2C3_ReadReg;
    TCPP0203IOCtx.WriteReg = BSP_I2C3_WriteReg;
    TCPP0203IOCtx.GetTick  = BSP_GetTick;

    /* Register the component on BUS IO */
    if (TCPP0203_RegisterBusIO(&USBPD_PWR_PortCompObj[PortNum], &TCPP0203IOCtx) != TCPP0203_OK)
    {
        ret = BSP_ERROR_BUS_FAILURE;
    }
    else
    {
        /* Initialisation step */
        USBPD_PWR_PortCompDrv[PortNum] = &TCPP0203_Driver;
        if (USBPD_PWR_PortCompDrv[PortNum]->Init(&USBPD_PWR_PortCompObj[PortNum]) != TCPP0203_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }

        /* Read the component type */
        if (USBPD_PWR_PortCompDrv[PortNum]->ReadTCPPType(&USBPD_PWR_PortCompObj[PortNum], &tcpp_type) != TCPP0203_OK)
        {
            ret = BSP_ERROR_COMPONENT_FAILURE;
        }

        /* Check the component type and update config accordingly */
        switch (tcpp_type)
        {
        case TCPP0203_DEVICE_TYPE_02:
            USBPD_PWR_Port_Configs[PortNum].Type = USBPD_PWR_HW_CONFIG_TYPE_TCPP02;
            BSP_USBPD_PWR_TRACE(PortNum, "-- TCPP02 detected");
            break;

        case TCPP0203_DEVICE_TYPE_03:
            USBPD_PWR_Port_Configs[PortNum].Type = USBPD_PWR_HW_CONFIG_TYPE_TCPP03;
            BSP_USBPD_PWR_TRACE(PortNum, "-- TCPP03 detected");
            break;

        default:
            USBPD_PWR_Port_Configs[PortNum].Type = USBPD_PWR_HW_CONFIG_TYPE_DEFAULT;
            BSP_USBPD_PWR_TRACE(PortNum, "-- Unknown TCPP type");
            ret = BSP_ERROR_UNKNOWN_COMPONENT;
            break;
        }

        if (ret == BSP_ERROR_NONE)
        {
            /* Reset TCPP0203 Reg0 register */
            if (USBPD_PWR_PortCompDrv[PortNum]->Reset(&USBPD_PWR_PortCompObj[PortNum]) != TCPP0203_OK)
            {
                ret = BSP_ERROR_COMPONENT_FAILURE;
            }

            /* Registration completed */
        }
    }
    return ret;
}

/**
 * @brief  De-Initialize TCPP0203 HW resources associated to Type-C port
 * @param  PortNum   Port number
 * @retval BSP Status
 */
static int32_t PWR_TCPP0203_ConfigDeInit(uint32_t PortNum)
{
    UNUSED(PortNum);
    return (BSP_ERROR_NONE);
}

/**
 * @brief  Handle Event callback
 * @param  PortNum   Port number
 * @retval None
 */
static void PWR_TCPP0203_EventCallback(uint32_t PortNum)
{
    uint8_t flg_reg = 0U;

    /* In case of TCPP0203, this callback could be called when an event is detected
       on FLGn line */
    if (USBPD_PWR_Port_Status[PortNum].IsInitialized == 1U)
    {
        /* Read Flags register (FLGn) */
        if (USBPD_PWR_PortCompDrv[PortNum]->ReadFlagRegister(&USBPD_PWR_PortCompObj[PortNum], &flg_reg) == TCPP0203_OK)
        {
#ifdef _TRACE
            char _str[13U];
            (void) sprintf(_str, "Reg2_0x%02x", flg_reg);
            BSP_USBPD_PWR_TRACE(PortNum, _str);
#endif /* _TRACE */

            /* If FLGn has been set to 0 in LOW POWER or HIBERNATE mode,
               it is expected that a VBUS_OK condition is detected.
               In this case, if any, vBus Detection callback could be called */
            switch (USBPD_PWR_Port_Status[PortNum].PwrSavingMode)
            {
            case USBPD_PWR_MODE_HIBERNATE:
            {
                if ((flg_reg & TCPP0203_FLAG_VBUS_OK_SET) == TCPP0203_FLAG_VBUS_OK_SET)
                {
                    if (USBPD_PWR_Port_Status[PortNum].VBUSDetectCallback != NULL)
                    {
                        /* In case of TCPP03 in Hibernate Mode (SNK config),
                           Mode is set to Low power to enable TCPP03 behavior on CC lines */
                        /* Switch to Low Power mode */
                        (void) BSP_USBPD_PWR_SetPowerMode(PortNum, USBPD_PWR_MODE_LOWPOWER);

                        USBPD_PWR_Port_Status[PortNum].VBUSDetectCallback(PortNum, VBUS_CONNECTED);
                    }
                }
                else
                {
                    /* In all other cases (NORMAL mode), FLGn signals fault detection events. */
                    BSP_USBPD_PWR_TRACE(PortNum, "-- Wrong detection --");
                }
                break;
            }

            case USBPD_PWR_MODE_LOWPOWER:
            {
                if ((flg_reg & TCPP0203_FLAG_VBUS_OK_SET) == TCPP0203_FLAG_VBUS_OK_SET)
                {
                    if (USBPD_PWR_Port_Status[PortNum].VBUSDetectCallback != NULL)
                    {
                        USBPD_PWR_Port_Status[PortNum].VBUSDetectCallback(PortNum, VBUS_CONNECTED);
                    }
                }
                else
                {
                    /* In all other cases (NORMAL mode), FLGn signals fault detection events. */
                    BSP_USBPD_PWR_TRACE(PortNum, "-- Wrong detection --");
                }
                break;
            }

            case USBPD_PWR_MODE_NORMAL:
            {
                uint32_t tickfault = HAL_GetTick();
                uint8_t recoveryword;

                /* In all other cases (NORMAL mode), FLGn signals fault detection events. */
                /* Check type of error raised in FLGn */
                if ((flg_reg & TCPP0203_FLAG_OCP_VCONN_SET) == TCPP0203_FLAG_OCP_VCONN_SET)
                {
                    BSP_USBPD_PWR_TRACE(PortNum, "-- OCP VCONN detected --");
                }
                if ((flg_reg & TCPP0203_FLAG_OCP_VBUS_SET) == TCPP0203_FLAG_OCP_VBUS_SET)
                {
                    BSP_USBPD_PWR_TRACE(PortNum, "-- OCP VBUS detected --");

                    /* Check if detected fault could be recovered */
                    /* In case of OCP fault, allow to restart and check if a 2nd OCP fault occurs in a limited time */
                    if ((tickfault > USBPD_PWR_Port_Status[PortNum].LastFaultTick) && ((tickfault - USBPD_PWR_Port_Status[PortNum].LastFaultTick) > USBPD_PWR_FAULT_MIN_TIME_RECOVERY))
                    {
                        /* Send Recovery word to TCPP0203 :
                           GDC and GDP open (TCPP0203_GD_PROVIDER_SWITCH_OPEN is 0) */
                        BSP_USBPD_PWR_TRACE(PortNum, "-- Send Recovery Word --");
                        recoveryword = TCPP0203_GD_CONSUMER_SWITCH_OPEN | TCPP0203_POWER_MODE_NORMAL;
                        (void) TCPP0203_WriteCtrlRegister(&USBPD_PWR_PortCompObj[PortNum], &recoveryword);

                        /* In case PWR Role is SRC, try to restore VBUS as soon as possible */
                        if (USBPD_PWR_Port_Status[PortNum].PwrRole == POWER_ROLE_SOURCE)
                        {
                            (void) TCPP0203_SetPowerMode(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_POWER_MODE_NORMAL);
                            (void) TCPP0203_SetGateDriverProvider(&USBPD_PWR_PortCompObj[PortNum], TCPP0203_GD_PROVIDER_SWITCH_CLOSED);
                            BSP_USBPD_PWR_TRACE(PortNum, "-- GDP/GDC setting : SRC (Restored) --");
                        }
                        else
                        {
                            if (USBPD_PWR_Port_Status[PortNum].VBUSDetectCallback != NULL)
                            {
                                /* Notify Error thanks to callback */
                                USBPD_PWR_Port_Status[PortNum].VBUSDetectCallback(PortNum, VBUS_NOT_CONNECTED);
                            }
                        }
                    }
                    USBPD_PWR_Port_Status[PortNum].LastFaultTick = tickfault;
                }
                if ((flg_reg & TCPP0203_FLAG_OVP_VBUS_SET) == TCPP0203_FLAG_OVP_VBUS_SET)
                {
                    BSP_USBPD_PWR_TRACE(PortNum, "-- OVP VBUS detected --");
                }
                if ((flg_reg & TCPP0203_FLAG_OTP_SET) == TCPP0203_FLAG_OTP_SET)
                {
                    BSP_USBPD_PWR_TRACE(PortNum, "-- Over Temp detected --");
                }
                if ((flg_reg & TCPP0203_FLAG_OVP_CC_SET) == TCPP0203_FLAG_OVP_CC_SET)
                {
                    BSP_USBPD_PWR_TRACE(PortNum, "-- OVP CC detected --");
                }
                break;
            }

            default:
            {
                /* Unexpected port state */
                BSP_USBPD_PWR_TRACE(PortNum, "-- Unexpected State for FLGn event --");
                break;
            }
            }
        }
    }
}

/**
 * @brief  Calculate the VBUS voltage level corresponding to ADC raw converted data.
 * @note   Voltage level is measured though a voltage divider
 *  Example :
 *  Voltage -- Ra ----.-   ^
 *                    |    |
 *                    Rb   | vadc = VBUS * Rb /(Ra + Rb)
 *                    |    |
 *                   GND   |
 * vadc = raw_data * (ADC_FULL_SCALE / VDD)
 * @param  ADCData  ADC raw converted data (resolution 12 bits)
 * @param  Ra       value of Ra resistance
 * @param  Rb       value of Rb resistance
 * @retval analog voltage (unit: mV)
 */
static uint32_t PWR_TCPP0203_ConvertADCDataToVoltage(uint32_t ADCData, uint32_t Ra, uint32_t Rb)
{
    uint32_t voltage;
    uint32_t vadc;

    voltage = 0U;

    /* Avoid dividing by zero */
    if (IS_PWR_TCPP0203_NOT_ZERO(Rb))
    {
        vadc    = (ADCData * VDD_VALUE) / ADC_FULL_SCALE;
        voltage = vadc * (Ra + Rb) / Rb;
    }

    return voltage;
}

/**
 * @brief  Calculate the VBUS current level corresponding to ADC raw converted data.
 * @note   ADC measurement provides measurement on IANA pin.
 * @param  ADCData  ADC raw converted data (resolution 12 bits)
 * @param  Ga       value of TCPP0X Iana gain in V/V
 * @param  Rs       value of shunt resistor in milliohm
 * @retval VBUS analog current (unit: mA)
 */
static int32_t PWR_TCPP0203_ConvertADCDataToCurrent(uint32_t ADCData, uint32_t Ga, uint32_t Rs)
{
    int32_t current;
    uint32_t vadc;

    current = 0;

    /* Avoid dividing by zero */
    if (IS_PWR_TCPP0203_NOT_ZERO(Ga * Rs))
    {
        vadc    = (ADCData * VDD_VALUE) / ADC_FULL_SCALE;
        current = ((int32_t) vadc * 1000) / ((int32_t) Ga * (int32_t) Rs);
    }

    return current;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
